// Напишите программу,
// которая принимает на вход трёхзначное число
// на выходе показывает последнюю цифру этого числа.
// 456 -> 6 782 -> 2 918 -> 8


// Console.WriteLine("Введите трехзначное число");

// Int32 nomber = Convert.ToInt32(Console.ReadLine());
// Int32 result = nomber%10;

// Console.WriteLine(result);

Console.WriteLine("Введите трехзначное число");
Int32 nomber = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(nomber%10);